# AdministrationManager
administrationManager.addBook.bookNull                   = Le livre \u00e0 ajouter est incorrect (livre vide) - Echec de l'ajout.
administrationManager.addBook.constraints                = Les informations concernant le livre sont incorrectes. Echec de la cr\u00e9ation du livre.
administrationManager.addAuthor.authorNull               = L'auteur \u00e0 ajouter est incorrect (auteur vide) - Echec de l'ajout.
administrationManager.addAuthor.constraints              = Les informations concernant l'auteur sont incorrectes. Echec de la cr\u00e9ation de l'auteur.
administrationManager.addGenre.genreNull                 = Le genre \u00e0 ajouter est incorrect (genre vide) - Echec de l'ajout.
administrationManager.addGenre.constraints               = Les informations concernant le genre sont incorrectes. Echec de la cr\u00e9ation du genre.
administrationManager.addPublisher.publisherNull         = L'\u00e9diteur \u00e0 ajouter est incorrect (\u00e9diteur vide) - Echec de l'ajout.
administrationManager.addPublisher.constraints           = Les informations concernant l'\u00e9diteur sont incorrectes. Echec de la cr\u00e9ation de l'\u00e9diteur.
administrationManager.addRole.roleNull                   = Le role \u00e0 ajouter est incorrect (role vide) - Echec de l'ajout.
administrationManager.addRole.constraints                = Les informations concernant le role sont incorrectes. Echec de la cr\u00e9ation du role.
administrationManager.modifyBook.bookNull                = Le livre \u00e0 modifier est incorrect (livre vide) - Echec de la modification.
administrationManager.modifyBook.constraints             = Les informations concernant le livre sont incorrectes. Echec de la modification du livre.
administrationManager.modifyAuthor.authorNull            = L'auteur \u00e0 modifier est incorrect (auteur vide) - Echec de la modification.
administrationManager.modifyAuthor.constraints           = Les informations concernant l'auteur sont incorrectes. Echec de la modification de l'auteur.
administrationManager.modifyGenre.genreNull              = Le genre \u00e0 modifier est incorrect (genre vide) - Echec de la modification.
administrationManager.modifyGenre.constraints            = Les informations concernant le genre sont incorrectes. Echec de la modification du genre.
administrationManager.modifyPublisher.publisherNull      = L'\u00e9diteur \u00e0 modifier est incorrect (\u00e9diteur vide) - Echec de la modification.
administrationManager.modifyPublisher.constraints        = Les informations concernant l'\u00e9diteur sont incorrectes. Echec de la modification de l'\u00e9diteur.
administrationManager.modifyRole.roleNull                = Le role \u00e0 modifier est incorrect (role vide) - Echec de la modification.
administrationManager.modifyRole.constraints             = Les informations concernant le role sont incorrectes. Echec de la modification du role.


# AuthentificationManager
authentificationManager.getConnectUser.loginPasswordNull = Le login et/ou le mot de passe sont incorrects (Login ou mot de passe vide) - Echec de la connection.
authentificationManager.getConnectUser.passDontMatch     = Le login et le mot de passe ne correspondent pas - Echec de la connection
authentificationManager.userModification.fullUserDtoNull = L'utilisateur \u00e0 modifier est incorrect (fullUserDto null) - La modification n'a pu \u00eatre faite.
authentificationManager.userModification.constraints     = Les modifications de l'utilisateur sont incorrects - Echec de la modification de l'utilisateur.
authentificationManager.userModification.passDontMatch   = Le mot de passe ne correspond pas \u00e0 l'utilisateur \u00e0 modifier. Echec de la modification.
authentificationManager.addNewUser.userConstraints       = Les informations concernant le nouvel utilisateur sont incorrects. Echec de la cr\u00e9ation.de l'utilisateur.
authentificationManager.addNewUser.addressConstraints    = Les informations concernant l'adresse du nouvel utilisateur sont incorrects. Echec de la cr\u00e9ation de l'utilisateur.
authentificationManager.giveRole.userIdNull              = L'identifiant de l'utilisateur est invalide (identifiant null) - L'ajout du role n'a pu se faire.
authentificationManager.giveRole.roleIdNull              = L'identifiant du role est invalide (identifiant null) - L'ajout du role n'a pu se faire.
authentificationManager.checkLoginAvailability.loginNull = Le login est incorrect (Login vide) - Echec de la v\u00e9rification de la disponibilit\u00e9 du login.

# BooksBorrowedListingManager
booksBorrowedListingManager.userIdNull                   = L'identifiant de l'utilisateur est incorrect (Identifiant vide) - Echec de la recherche.

# BooksListingManager
booksListingManager.getSearchBooks.integrityViolation    = Les donn\u00e9es contenues dans les crit\u00e8res de recherches ne sont pas valides. La recherche est abandonn\u00e9e.

#BooksManagementManager
booksManagementManager.bookBorrowing.userOrBookNull      = L'identifiant de l'utilisateur et/ou du livre est incorrect (Identifiant vide) - Echec de l'ajout de l'emprunt.
booksManagementManager.bookBorrowing.noEnoughStock=Le stock du livre est insuffisant pour r\u00e9aliser un emprunt. Echec de l'emprunt.

booksManagementManager.bookReservation.userOrBookNull = L'identifiant de l'utilisateur et/ou du livre est incorrect (Identifiant vide) - Echec de l'ajout de la r\u00e9servation.
booksManagementManager.bookReservation.reservationfull = La liste d'attente des r\u00e9servations est pleine.
booksManagementManager.bookReservation.alreadyReserved = La r\u00e9servation ne peut \u00eatre faite, le livre est d\u00e9j\u00e0 r\u00e9serv\u00e9 par l'utilisateur.
booksManagementManager.bookReservation.alreadyBorrow = La r\u00e9servation ne peut \u00eatre faite, le livre est d\u00e9j\u00e0 emprunt\u00e9 par l'utilisateur.
booksManagementManager.cancelReservation.idNull = L'identifiant de la r\u00e9servation est incorrect (Identifiant vide) - Echec de l'annulation de la r\u00e9servation.
booksManagementManager.userReservationsList.userIdNull = L'identifiant de l'utilisateur est incorrect (Identifiant vide) - Echec de la récupération de la liste des r\u00e9servations.  
booksManagementManager.sendMailBookAvailable.userNotFound = L'utilisateur n'a pas été trouvé - Echec de l'envoi de l'email.
booksManagementManager.sendMailBookAvailable.bookNull = Le livre est incorrect (Livre vide) - Echec de l'envoi de l'email.
booksManagementManager.sendMailBookAvailable.reservationNotFound = la r\u00e9servation n'a pas été trouvé - Echec de l'envoi de l'email.

booksManagementManager.extendBorrow.idNull               = L'identifiant de l'emprunt est incorrect (Identifiant vide) - Echec de l'extension de l'emprunt.
booksManagementManager.extendBorrow.extensionTrue        = L'emprunt a d\u00e9j\u00e0 \u00e9t\u00e9 prolong\u00e9. Le prolongement de l'emprunt n'a pu \u00eatre fait.
booksManagementManager.extendBorrow.returned             = Le livre emprunt\u00e9 a d\u00e9j\u00e0 \u00e9t\u00e9 rendu. Le prolongement de l'emprunt ne peut donc se faire.
booksManagementManager.extendBorrow.endPassed            = Le livre emprunt\u00e9 aurait d\u00e9j\u00e0 du \u00eatre rendu. L'extension de l'emprunt n'est pas possible.
booksManagementManager.returnBorrow.idNull               = L'identifiant de l'emprunt est incorrect (Identifiant vide) - Echec du retour de l'emprunt.
booksManagementManager.returnBorrow.returned             = Le livre emprunt\u00e9 a d\u00e9j\u00e0 \u00e9t\u00e9 rendu. Le retour de l'emprunt ne peut donc se faire.
booksManagementManager.getBookWithDetails.idNull         = L'identifiant du livre est incorrect (Identifiant vide) - Echec de la recherche.



booksManagementManager.sendReminderMails.mail = Bonjour,<br><br> vous avez des livres non rendus. Veuillez vous connecter sur le site de la biblioth&egrave;que Bradbury pour plus de d&eacute;tails.
booksManagementManager.sendReminderMails.object = Livre non rendu

booksManagementManager.sendMailBookAvailable.mail = Bonjour,<br><br> vous avez 48h pour retirer le livre :<br>
booksManagementManager.sendMailBookAvailable.object = R\u00e9servation disponible
