# User
user.login.empty                       = L'identifiant de l'utilisateur doit \u00eatre renseign\u00e9.
user.login.size                        = L'identifiant ne peut avoir que 30 caract\u00e8res au maximum.
user.password.empty                    = Il est obligatoire de renseigner le mot de passe.
user.password.size                     = Le mot de passe ne peut avoir que 100 caract\u00e8res au maximum.
user.email.size                        = Votre adresse mail est trop longue. Elle ne doit pas contenir plus de 100 caract\u00e8res.
user.email.empty                       = L'adresse email ne peut \u00eatre vide.
user.email.format                      = Votre adresse mail est trop longue. Elle ne doit pas contenir plus de 100 caract\u00e8res.
user.phone.size                        = Le num\u00e9ro de t\u00e9l\u00e9phone doit contenir 10 chiffres.
user.address.null                      = Une adresse doit \u00eatre associ\u00e9e \u00e0 l'utilisateur.
user.options.null                      = L'identifiant correspondant aux options de l'utilisateur doit \u00eatre renseign\u00e9.

# Role
role.roleName.empty                    = Le nom du role doit \u00eatre renseign\u00e9.
role.roleName.size                     = Le nom du role ne peut avoir que 25 caract\u00e8res au maximum.

# Address
address.line1.empty                    = La premi\u00e8re ligne de l'adresse doit \u00eatre renseign\u00e9e.
address.line1.size                     = La premi\u00e8re ligne ne peut avoir que 200 caract\u00e8res au maximum.
address.line2.size                     = La seconde ligne ne peut avoir que 200 caract\u00e8res au maximum.
address.line3.size                     = La troisi\u00e8me ligne ne peut avoir que 200 caract\u00e8res au maximum.
address.city.empty                     = La ville doit \u00eatre renseign\u00e9e.
address.city.size                      = La nom de la ville doit avoir 100 caract\u00e8res au maximum.
address.zipCode.empty                  = Le code postal doit \u00eatre renseign\u00e9.
address.zipCode.size                   = Le code postal doit \u00eatre constitu\u00e9 de 5 chiffres.

# UserRoles
userRoles.userId.null                  = L'identifiant de l'utilisateur doit \u00eatre renseign\u00e9.
userRoles.roleId.null                  = L'identifiant du role doit \u00eatre renseign\u00e9.

# UserOptions
UserOptions.beforeReminder.null        = L'option beforeReminder doit \u00eatre renseign\u00e9.

# Author
author.firstName.empty                 = Le pr\u00e9nom de l'auteur doit \u00eatre renseign\u00e9.
author.firstName.size                  = Le pr\u00e9nom de l'auteur doit contenir au maximum 50 caract\u00e8res.
author.lastName.empty                  = Le nom de l'auteur doit \u00eatre renseign\u00e9.
author.lastName.size                   = Le nom de l'auteur doit contenir au maximum 50 caract\u00e8res.

# Book
book.title.empty                       = Le titre du livre doit \u00eatre renseign\u00e9.
book.title.size                        = Le titre doit contenir au maximum 150 caract\u00e8res.
book.isbn13.empty                      = L'ISBN13 doit \u00eatre renseign\u00e9.
book.isbn13.size                       = L'ISBN13 doit \u00eatre constitu\u00e9 de 17 caract\u00e8res (avec les - de s\u00e9paration).
book.ean13.empty                       = L'EAN13 doit \u00eatre renseign\u00e9.
book.ean13.size                        = L'EAN13 doit \u00eatre constitu\u00e9 de 13 caract\u00e8res.
book.publishingDate.null               = La date de publication doit \u00eatre renseign\u00e9e.
book.resume.empty                      = Le r\u00e9sum\u00e9 du livre doit \u00eatre renseign\u00e9.
book.resume.size                       = Le r\u00e9sum\u00e9 du livre doit contenir au maximum 5000 caract\u00e8res.
book.genreId.null                      = L'id du genre associ\u00e9 au livre doit \u00eatre renseign\u00e9.
book.publisherId.null                  = L'id de l'\u00e9diteur du livre doit \u00eatre renseign\u00e9.

# Genre
genre.name.empty                       = Le nom du genre doit \u00eatre renseign\u00e9.
genre.name.size                        = Le nom doit \u00eatre constitu\u00e9 de 50 caract\u00e8res maximum.

# Publisher
publisher.name.empty                   = Le nom de l'\u00e9diteur doit \u00eatre renseign\u00e9.
publisher.name.size                    = Le nom de l'\u00e9diteur doit \u00eatre constitu\u00e9 au maximum de 100 caract\u00e8res.

# Stock
stock.bookId.null                      = L'identifiant du livre associ\u00e9 au stock doit \u00eatre renseign\u00e9.
stock.amountAvailable.null             = Le nombre d'exemplaire disponible du livre doit \u00eatre renseign\u00e9.
stock.amount.null                      = Le nombre total d'exemplaire du livre doit \u00eatre renseign\u00e9.

# BookAuthors
bookAuthors.bookId.null                = L'identifiant du livre doit \u00eatre renseign\u00e9.
bookAuthors.authorId.null              = L'identifiant de l'auteur doit \u00eatre renseign\u00e9.

# BookBorrowed
bookBorrowed.bookBorrowedId.null       = L'identifiant de l'emprunt doit \u00eatre renseign\u00e9.
bookBorrowed.userId.null               = L'identifiant de l'utilisateur doit \u00eatre renseign\u00e9.
bookBorrowed.bookId.null               = L'identificant du livre doit \u00eatre renseign\u00e9.
bookBorrowed.endDate.null              = La date de fin de l'emprunt doit \u00eatre renseign\u00e9e.
bookBorrowed.borrowDate.null           = La date de l'emprunt doit \u00eatre renseign\u00e9e.
bookBorrowed.extension.null            = Il est n\u00e9cessaire d'indiquer si l'emprunt a \u00e9t\u00e9 prolong\u00e9 ou non.
bookBorrowed.nbReminder.null           = Le nombre de relance d'un emprunt non rendu doit \u00eatre renseign\u00e9.
bookBorrowed.returned.null             = Le statut du retour du livre emprunt\u00e9 doit \u00eatre renseign\u00e9.
bookBorrowed.lastReminder.null         = La date de la derni\u00e8re relance doit \u00eatre renseign\u00e9e.

# BookReservation
bookReservation.bookId.null            = L'identificant du livre doit \u00eatre renseign\u00e9.
bookReservation.userId.null            = L'identifiant de l'utilisateur doit \u00eatre renseign\u00e9.
bookReservation.dateReservation.null   = La date de r\u00e9servation doit \u00eatre renseign\u00e9e.
bookReservation.activeReservation.null = Le statut de la r\u00e9servation doit \u00eatre renseign\u00e9.

# BookDetailsDto
bookDetailsDto.authors.empty           = La liste des auteurs du livre ne peut \u00eatre vide.

# BookBorrowsCountDto
bookBorrowsCountDto.nbBorrow.null      = Le nombre d'emprunt pour un livre ne peut \u00eatre null.
